{
  "workDetails": [
    {
      "id": 1,
      "title": "Case Study: Main Battle Screen for Idle RPG Game",
      "subtitle": "Designing a Visually Engaging and Intuitive Main Battle Screen",
      "tags": [
        {
          "href": "/services/full-time-role",
          "label": "Full Time Role"
        }
      ],
      "image": {
        "src": "images/battle.png",
        "alt": "Main Battle Screen Image"
      },
      "content": [
        {
          "type": "heading",
          "content": "Overview"
        },
        {
          "type": "text",
          "content": "Objective: To design a visually engaging and intuitive main battle screen for an idle RPG game that enhances player interaction, ensures accessibility for key gameplay features, and maintains a consistent theme aligned with the fantasy genre."
        },
        {
          "type": "text",
          "content": "Target Audience:\n• Casual Players: Focused on ease of use and intuitive controls for new users.\n• Hardcore Players: Expect detailed stats, efficient navigation, and access to advanced mechanics."
        },
        {
          "type": "text",
          "content": "Role: UI/UX Designer\n• Collaborated with game designers, developers, and artists to conceptualize, prototype, and implement the final UI design."
        },
        {
          "type": "heading",
          "content": "Problem Statement"
        },
        {
          "type": "list",
          "items": [
            "Cluttered Information: Idle RPG games often overwhelm players with resource data, character stats, and menu options.",
            "Navigation Complexity: Players need quick access to various features like upgrades, quests, and party management without disrupting gameplay.",
            "Theme Integration: The interface needed to feel immersive and aligned with the game’s fantasy world."
          ]
        },
        {
          "type": "heading",
          "content": "Design Goals"
        },
        {
          "type": "list",
          "items": [
            "Create a clear information hierarchy to prioritize combat-critical elements.",
            "Design touch-friendly controls for mobile platforms while retaining usability for desktop players.",
            "Ensure visual cohesion between the UI and the game’s fantasy aesthetic.",
            "Provide real-time feedback for player actions and battle progress."
          ]
        },
        {
          "type": "heading",
          "content": "Research and Analysis"
        },
        {
          "type": "text",
          "content": "User Research:\n• Conducted surveys and interviews with players of similar idle RPG games to understand their pain points and preferences.\n• Key findings:\n  • Players value clear visual indicators during battles.\n  • Simplified navigation and quick access to upgrades enhance engagement.\n  • Animations and feedback improve satisfaction."
        },
        {
          "type": "text",
          "content": "Competitive Analysis:\n• Analyzed successful idle RPG games for UI/UX design patterns.\n• Observed the balance between game aesthetics and practicality in interfaces."
        },
        {
          "type": "heading",
          "content": "Design Process"
        },
        {
          "type": "text",
          "content": "Wireframing:\n• Sketched layouts to test the placement of key elements:\n  • Top Bar: Combat-critical stats (HP, player/enemy level).\n  • Bottom Bar: Actionable elements like skills and abilities.\n  • Side Panels: Secondary options (inventory, upgrades, shop)."
        },
        {
          "type": "image",
          "src": "images/projects/project1/large-battle-wireframe.png"
        },
        {
          "type": "heading",
          "content": "Final Design Features"
        },
        {
          "type": "heading",
          "content": "6.1 Information Hierarchy"
        },
        {
          "type": "text",
          "content": "Top Bar:\n• Displays HP bars (player and enemy) prominently for quick monitoring.\n• Levels and progress timers are visible without distracting from the battle."
        },
        {
          "type": "text",
          "content": "Center Screen:\n• Focuses on visualizing the battle with character models and animations."
        },
        {
          "type": "text",
          "content": "Quest Panel (Bottom Left):\n• Highlights active quests with progress bars and actionable instructions."
        },
        {
          "type": "text",
          "content": "Action Panel (Bottom Center):\n• Skill buttons are visually distinct with cooldown timers and ready-state feedback."
        },
        {
          "type": "heading",
          "content": "6.2 Visual Design"
        },
        {
          "type": "text",
          "content": "Color Palette:\n• Used vibrant colors (green for upgrades, red for health) for clarity and engagement."
        },
        {
          "type": "text",
          "content": "Typography:\n• Clear, readable fonts with proper scaling for mobile and desktop platforms."
        },
        {
          "type": "heading",
          "content": "6.3 Accessibility and Interaction"
        },
        {
          "type": "text",
          "content": "Touch-Friendly Design:\n• Large, easily tappable buttons for mobile users."
        },
        {
          "type": "text",
          "content": "Dynamic Feedback:\n• Coin pickups, glowing buttons, and HP bar animations add a layer of interactivity."
        },
        {
          "type": "text",
          "content": "Platform Scalability:\n• Optimized layouts for seamless transitions between mobile and desktop gameplay."
        },
        {
          "type": "heading",
          "content": "Challenges and Solutions"
        },
        {
          "type": "list",
          "items": [
            "Challenge 1: Managing screen clutter while retaining functionality.\nSolution: Organized elements into panels and prioritized key features (e.g., quests, upgrades) based on player interaction frequency.",
            "Challenge 2: Ensuring usability for new and experienced players.\nSolution: Created tooltips and added visual guides (e.g., quest progress indicators) for first-time users while maintaining quick access for experienced players.",
            "Challenge 3: Aligning UI with the fantasy theme.\nSolution: Designed custom icons and backgrounds inspired by medieval and fantasy motifs."
          ]
        },
        {
          "type": "image",
          "src": "images/projects/project1/before-main-battle.png"
        },
        {
          "type": "image",
          "src": "images/projects/project1/after-main-battle.png"
        },
        {
          "type": "heading",
          "content": "Results and Impact"
        },
        {
          "type": "list",
          "items": [
            "Qualitative Feedback:\n• Players appreciated the clear hierarchy and immersive visuals.",
            "Testers reported a smoother navigation experience compared to the previous iteration."
          ]
        },
        {
          "type": "heading",
          "content": "Reflection"
        },
        {
          "type": "list",
          "items": [
            "User Feedback is Key: Iterative testing helped fine-tune the interface to balance aesthetics and usability.",
            "Clarity Over Complexity: Simplified designs are more engaging and easier to navigate, especially for mobile users."
          ]
        }
      ]
    },    
    {
      "id": 2,
      "title": "Gem Store Menu - Firestone Idle RPG",
      "subtitle": "Creating Engaging Interfaces to Boost Purchases and Drive Monetization",
      "tags": [
        {
          "href": "/services/full-time-role",
          "label": "Full Time Role"
        }
      ],
      "image": {
        "src": "images/store.png",
        "alt": "Store Menu Image"
      },
      "content": []
    },
    {
      "id": 3,
      "title": "Case Study: Designing Seasonal Event Promotional Banners for an Idle RPG Game",
      "subtitle": "Crafting Engaging Banners to Captivate and Motivate Players",
      "tags": [
        {
          "href": "/services/full-time-role",
          "label": "Full Time Role"
        }
      ],
      "image": {
        "src": "images/seasonal.png",
        "alt": "Seasonal Events Image"
      },
      "content": [
        {
          "type": "heading",
          "content": "Overview"
        },
        {
          "type": "text",
          "content": "I was responsible for designing the UI and promotional banners for seasonal in-game events. These designs not only highlighted the unique themes of each event but also aimed to captivate players and encourage their participation. The events featured exclusive, time-limited rewards such as skins and avatars, making them highly engaging and motivating for the player base."
        },
        {
          "type": "heading",
          "content": "Goals"
        },
        {
          "type": "list",
          "items": [
            "Attract Player Attention: Create visually compelling designs that immediately grab players' interest.",
            "Convey Event Information: Clearly communicate the theme, event name, and rewards at a glance.",
            "Enhance User Engagement: Encourage participation by showcasing the exclusivity of limited-time rewards."
          ]
        },
        {
          "type": "heading",
          "content": "Challenges"
        },
        {
          "type": "list",
          "items": [
            "Consistency Across Themes: Balancing creativity for unique themes while maintaining the game’s brand identity.",
            "Space Constraints: Ensuring all key information and visuals fit into the limited banner space without feeling cluttered.",
            "Player Motivation: Effectively highlighting rewards to generate excitement and drive engagement."
          ]
        },
        {
          "type": "heading",
          "content": "My Design Process"
        },
        {
          "type": "text",
          "content": "1. Research and Ideation\n• I collaborated closely with the game design team to understand each event's lore, characters, and objectives.\n• I analyzed previous banners to identify design elements that resonated with players and performed well."
        },
        {
          "type": "heading",
          "content": "My Design Approach"
        },
        {
          "type": "text",
          "content": "Decorated Heroes (Medieval Festival): For the \"Decorated Heroes\" event, I wanted to capture the festive spirit of a medieval celebration. I chose a bright castle backdrop complemented by celebratory confetti to set the mood. The characters were designed in regal medieval attire, emphasizing intricate details to reflect the grandeur of the era. Gold and red tones were selected to create a royal and festive atmosphere."
        },
        {
          "type": "image",
          "src": "images/projects/project3/decorated-heroes.png"
        },
        {
          "type": "text",
          "content": "Trick or Treat (Halloween): For the \"Trick or Treat\" event, I aimed to evoke the spooky yet playful essence of Halloween. A deep purple background featuring a glowing full moon and flying bats set the perfect eerie tone. The avatars, including pumpkin-headed characters and witches, brought a whimsical and seasonal touch. Green and orange accents were added to evoke the classic Halloween palette, while the fun, rounded game's font style helped maintain an approachable and playful tone."
        },
        {
          "type": "image",
          "src": "images/projects/project3/halloween-event.png"
        },
        {
          "type": "text",
          "content": "Love Is in the Air (Valentine’s Day): The \"Love Is in the Air\" event allowed me to explore the romantic themes of Valentine’s Day. I chose pink and red tones as the foundation, framing the visuals with rose motifs to heighten the romantic vibe. The characters were styled with elements like roses, hearts, and elegant outfits to embody the theme. To add a unique twist, I included a humorous goblin character holding a rose."
        },
        {
          "type": "image",
          "src": "images/projects/project3/love-is-in-the-air.png"
        },
        {
          "type": "text",
          "content": "Nature’s Dance (Spring Festival): \"Nature’s Dance\" was inspired by the renewal and beauty of spring. I used soft pastel colors with floral elements like roses and butterflies to create a cheerful and inviting atmosphere. The characters were dressed in vibrant, spring-themed outfits that complemented the glowing sunburst in the background."
        },
        {
          "type": "text",
          "content": "Tropicana (Summer Event): For the \"Tropicana\" event, I wanted to convey the joy and relaxation of summer. Vibrant colors like turquoise and coral brought the tropical theme to life, while elements like palm trees, sandy beaches, and sunglasses emphasized the season’s carefree vibe."
        },
        {
          "type": "text",
          "content": "Winter Festival (Christmas): For the \"Winter Festival\" event, I focused on creating a festive and cozy holiday atmosphere. Snow-covered trees and a cheerful reindeer character were central to the design. Cool tones of blue and white contrasted with warm festive red to evoke a sense of warmth amidst the winter chill. Sparkling stars and snowflakes added depth to the background, while the bold and cheerful font style enhanced the festive spirit."
        },
        {
          "type": "image",
          "src": "images/projects/project3/winter-festival.png"
        },
        {
          "type": "text",
          "content": "Astral Alignment (Sci-fi Cosmic Event): With \"Astral Alignment,\" I delved into the futuristic and cosmic theme. A deep blue space palette served as the perfect backdrop for this event, creating a sense of wonder and exploration. Futuristic avatars, including astronauts and cosmic creatures, were designed to resonate with the sci-fi aesthetic. I ensured to incorporate characters and rewards prominently, ensuring they were the focal point of each banner."
        },
        {
          "type": "image",
          "src": "images/projects/project3/astral-aligment.png"
        },
        {
          "type": "heading",
          "content": "Outcome"
        },
        {
          "type": "list",
          "items": [
            "Increased player participation in seasonal events by 33%.",
            "Positive feedback from players, praising the clarity and aesthetic appeal of the banners.",
            "Reinforced the game’s brand identity while enhancing the user experience."
          ]
        },
        {
          "type": "heading",
          "content": "Key Takeaways"
        },
        {
          "type": "list",
          "items": [
            "Understand the Audience: Knowing what appeals to the target demographic is critical to designing effective UI/UX.",
            "Iterate Based on Feedback: Player insights are invaluable for improving design clarity and engagement.",
            "Balance Creativity and Functionality: While aesthetics are important, ensuring the message is clear is equally essential."
          ]
        }
      ]
    },        
    {
      "id": 4,
      "title": "Designing Seasonal Event Promotional Banners - Firestone Idle RPG",
      "subtitle": "Designing Seasonal Event Promotional Banners - Firestone Idle RPG",
      "tags": [
        {
          "href": "/services/full-time-role",
          "label": "Full Time Role"
        }
      ],
      "image": {
        "src": "images/promo.png",
        "alt": "Promo Image"
      },
      "content": []
    }
  ]
}